src/InformationRegisters/ЗаданияКРасчетуСтруктурыЗаказаНормативныйГрафик/ЗаданияКРасчетуСтруктурыЗаказаНормативныйГрафик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКРасчетуСтруктурыЗаказаНормативныйГрафик</name>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПартия</name>
    <comment>Ключ связи, идентификатор узла структуры заказа</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормативныйГрафикСтруктурыЗаказа/НормативныйГрафикСтруктурыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативныйГрафикСтруктурыЗаказа</name>
  <resources>
    <name>Начало</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПартия</name>
    <comment>Ключ связи, идентификатор узла структуры заказа</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделительЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗаданияКРасчетуСтруктурыЗаказаНормативныйГрафик/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет задания к расчету структуры заказа на производство
// 
// Параметры:
// 	Таблица - ТаблицаЗначений - задания к расчету
// 
Процедура ДобавитьЗадания(Таблица) Экспорт
	
	Колонки = ?(Таблица.Колонки.Найти("КлючПартия") = Неопределено,
		"ЗаказНаПроизводство",
		"ЗаказНаПроизводство, КлючПартия");
	Таблица.Свернуть(Колонки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураЗаказа.ЗаполнитьИЗаписатьНаборЗаписей(
		РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаНормативныйГрафик.СоздатьНаборЗаписей(),
		Таблица,
		Ложь,
		Истина);
		
КонецПроцедуры

Процедура ДобавитьЗадание(ЗаказНаПроизводство, КлючПартия = Неопределено, ЗапуститьРасчет = Ложь) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ЗаказНаПроизводство", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2"));
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ЗаказНаПроизводство = ЗаказНаПроизводство;
	
	Если КлючПартия <> Неопределено Тогда
		Таблица.Колонки.Добавить("КлючПартия", Новый ОписаниеТипов("УникальныйИдентификатор"));
		НоваяСтрока.КлючПартия = КлючПартия;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураЗаказа.ЗаполнитьИЗаписатьНаборЗаписей(
		РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаНормативныйГрафик.СоздатьНаборЗаписей(),
		Таблица,
		Ложь,
		Истина);
	
	Если ЗапуститьРасчет Тогда
		РегистрыСведений.НормативныйГрафикСтруктурыЗаказа.ЗапуститьРасчет();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
